app/controllers/projects/users_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]
---
  def index
    @project = Project.all.find(params[:project_id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 9]]
---
  def new
    @project = Project.all.find(params[:project_id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 9]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "batata@batata.com"]]
---
  def create
        @project = Project.all.find(params[:project_id])

    @user = User.find_by_email(params[:email])