app/views/users/show.html.erb

                <div class="col-xs-12">
                  <strong class="profile-stat-count"><%= @user.projects.size %></strong>
---
SELECT "projects".* FROM "projects" INNER JOIN "projects_users" ON "projects"."id" = "projects_users"."project_id" WHERE "projects_users"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "projects" INNER JOIN "projects_users" ON "projects"."id" = "projects_users"."project_id" WHERE "projects_users"."user_id" = ?  [["user_id", 1]]