app/views/projects/edit.html.erb

SELECT "widgets".* FROM "widgets" WHERE "widgets"."project_id" = ? AND (tab= 'about')  [[nil, 1]]
---
    <!-- TAB ABOUT -->
    <% @project.widgets.from_tab_about.each do |widget| %>