app/views/projects/index.html.erb

                          <div class="pull-right">
                          <% if !current_user.favorited_projects.include?(project) %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]