app/views/projects/show.html.erb

    <!-- TAB ABOUT -->
    <% @project.widgets.from_tab_about.each do |widget| %>
---
SELECT "widgets".* FROM "widgets" WHERE "widgets"."project_id" = ? AND (tab= 'about')  [["project_id", 6]]