app/controllers/login_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "rafaelsm.br@gmail.com"]]
---
  def create
    user = User.find_by_email(params[:user][:email])