app/controllers/projects_controller.rb

  def index
    @projects = Project.all.search(params[:search])
    if current_user
      @myproject = current_user.projects.build
    else
      @myproject = Project.all.search("nenhum")
---
SELECT "projects".* FROM "projects" WHERE (name LIKE '%nenhum%')
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]

  def show
    @codigourl = params[:id]
    @language = Language.where(:id => @project.language_id).first
    @tool = Tool.where(:id => @project.tool_id).first
    @operationalsystem = OperationalSystem.where(:id => @project.operational_system_id).first
---
SELECT  "languages".* FROM "languages" WHERE "languages"."id" IS NULL  ORDER BY "languages"."id" ASC LIMIT 1
SELECT  "tools".* FROM "tools" WHERE "tools"."id" IS NULL  ORDER BY "tools"."id" ASC LIMIT 1
SELECT  "operational_systems".* FROM "operational_systems" WHERE "operational_systems"."id" IS NULL  ORDER BY "operational_systems"."id" ASC LIMIT 1

  def edit
    @codigourl = params[:id]
    @language = Language.where(:id => @project.language_id).first
    @tool = Tool.where(:id => @project.tool_id).first
    @operationalsystem = OperationalSystem.where(:id => @project.operational_system_id).first
---
SELECT  "languages".* FROM "languages" WHERE "languages"."id" IS NULL  ORDER BY "languages"."id" ASC LIMIT 1
SELECT  "tools".* FROM "tools" WHERE "tools"."id" IS NULL  ORDER BY "tools"."id" ASC LIMIT 1
SELECT  "operational_systems".* FROM "operational_systems" WHERE "operational_systems"."id" IS NULL  ORDER BY "operational_systems"."id" ASC LIMIT 1

  def create
    @project = Project.new(project_params)

    ohp = OpenHubProject.find_by_name(@project.name).first if params[:openhub_check]
    @project.image_url = ohp.medium_logo_url if ohp else "/assets/placeholder.png"
    @project.widgets = make_all_widgets(ohp)
    @project.owners << current_user
---
INSERT INTO "projects" ("name", "description", "user_id", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "new"], ["description", "test"], ["user_id", 2], ["image_url", "assets/placeholder.png"], ["created_at", "2016-08-13 14:47:16.046666"], ["updated_at", "2016-08-13 14:47:16.046666"]]
INSERT INTO "widgets" ("title", "slug", "tab", "pos_x", "pos_y", "width", "height", "closeable", "content", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if(params[:widget])
      widget = @project.widgets.find_by_slug(widget_params[:slug])
      widget.update_attributes(widget_params)
---
SELECT  "widgets".* FROM "widgets" WHERE "widgets"."project_id" = ? AND "widgets"."slug" = ? LIMIT 1  [["project_id", 5], ["slug", "links"]]
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "dfsaT"], ["updated_at", "2016-08-21 07:39:32.652367"], ["id", 7]]
UPDATE "widgets" SET "content" = ?, "updated_at" = ? WHERE "widgets"."id" = ?  [["content", "\n                Fill with textdsafd"], ["updated_at", "2016-08-21 06:52:10.056153"], ["id", 7]]

    def set_project
      @project = Project.all.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]