app/controllers/projects_controller.rb

    def set_project
      @project = Project.includes(:widgets).find(params[:id])
---
SELECT "widgets".* FROM "widgets" WHERE "widgets"."project_id" = ? AND (tab= 'about')  [["project_id", 6]]