app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "encrypted_password", "photo_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def set_user
    @user = User.friendly.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]